import React from "react";
import { TextBox, Subtitle, TextUl } from "./StyledTextBox.js";

const BoxTexts = () => {
  return (
    <div>
      <TextBox>
        <h4>Менеджер по гос.закупкам</h4>
        <Subtitle>Обязанности: </Subtitle>
        <TextUl>
          <li>
            > Мероприятия по сбору и получению информации об условиях
            готовящихся государственных и частных конкурсах;
          </li>
          <li>
            > Анализ условий конкурсов и составление на основе требуемых закупок
            (поставка товаров, выполнение работ, оказание услуг) списка
            предполагаемых субподрядчиков и соисполнителей работ и услуг;
          </li>
          <li>
            > Ведение переговоров с заказчиками - контрагентами (коммерческими
            организациями, государственными учреждениями и органами) по вопросам
            проводимых конкурсов и государственных закупок;
          </li>
          <li>
            > Подготовка и оформление конкурсных заявок с учетом всех требований
            действующего законодательства о государственных закупках, в том
            числе субподрядных организаций и соисполнителей работ и услуг
            соответственно;
          </li>
        </TextUl>
      </TextBox>
      <TextBox>
        <Subtitle>Требования:</Subtitle>
        <TextUl>
          <li>> Высшее образование (юридическое или экономическое);</li>
          <li>> Опыт работы на данной позиции не менее трех лет;</li>
          <li>
            > Знание законодательной базы в сфере гос. закупок (Правила
            госзакупок, Правила закупок АО "Самрук-Казына");
          </li>
          <li>
            > Способность быстро обрабатывать информацию и вести несколько
            проектов одновременно;
          </li>
          <li>
            > Знание офисной техники, офисных программ: таблицы; аналитический
            склад ума.
          </li>
        </TextUl>
      </TextBox>
      <TextBox>
        <Subtitle>Условия:</Subtitle>
        <TextUl>
          <li>> Достойная заработная плата;</li>
          <li>> Премирование по результатам;</li>
          <li>> Оформление по ТК РК;</li>
          <li>> Возможность развития.</li>
        </TextUl>
      </TextBox>
      <TextBox>
        <h4>Инженер ПТО</h4>
        <Subtitle>Обязанности:</Subtitle>
        <TextUl>
          <li>
            > Разработка графиков строительного производства, ППР и другие
            технические документации (Акты на скрытые работы, Акты выполненных
            работ Ф-2 и т.д.);
          </li>
          <li>
            > Проверка и согласование расчетов удорожания работ субподрядчиков;
          </li>
          <li>
            > Контроль движения проектно-сметной документации, выдача ее
            производителям работ и субподрядчикам;
          </li>
          <li>
            > Учет выполненных работ субподрядчиков, проверка и оформление актов
            выполненных работ;
          </li>
          <li>
            > Осуществление контроля за соответствием списания материалов по
            проекту и нормам расхода;
          </li>
          <li>
            > Сбор технической документации: выносы основного и вспомогательного
            репера, посадки здания, разбивка осей фундаментов, на скрытые
            работы, просветки ванной сварки, исполнительные съемки по этажам и
            инженерным сетям и их профиля, сертификаты на основные
            стройматериалы.
          </li>
        </TextUl>
      </TextBox>
      <TextBox>
        <Subtitle>Требования:</Subtitle>
        <TextUl>
          <li>
            > Опыт работы в сфере строительства от 5 лет, а именно инженером ПТО
            от 3 лет;
          </li>
          <li>
            > Знание и умение работ программными комплексами - ABC, AutoCad,
            Excel, чтение ПСД;
          </li>
          <li>> Контроль в составлении актов на скрытые работы.</li>
        </TextUl>
      </TextBox>
      <TextBox>
        <Subtitle>Условия:</Subtitle>
        <TextUl>
          <li>> Достойная заработная плата;</li>
          <li>> Оформление по ТК РК;</li>
          <li>> Возможность роста и развития</li>
        </TextUl>
      </TextBox>
    </div>
  );
};
export default BoxTexts;
